<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Sub Queries</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    SubQueries is a query within another query<br>it is a SELECT statement that is nested inside another SELECT ,INSERT, UPDATE or DELETE statement<br><br>The subquery  is executed  first , and its result is then used as a parameter or condition for the outer query <br><br>Note ! The topic is slightly dificult and needs a lot of practice
</div>

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/mydb

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">For Example
</div>

In [2]:
%%sql
SELECT * FROM movies

LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146),
 ('The Blue Lagoon', 'R', 'Adventure', 1980, 'July 2, 1980 (United States)', 5.8, 65000, 'Randal Kleiser', 'Henry De Vere Stacpoole', 'Brooke Shields', 'United States', 4500000, 58853106.0, 'Columbia Pictures', 104)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find  the movie with highest rating
</div>

In [3]:
%%sql
SELECT * FROM movies 
ORDER BY score DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shawshank Redemption', 'R', 'Drama', 1994, 'October 14, 1994 (United States)', 9.3, 2400000, 'Frank Darabont', 'Stephen King', 'Tim Robbins', 'United States', 25000000, 28817291.0, 'Castle Rock Entertainment', 142)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now solve this question with subquery
</div>

In [4]:
%%sql
SELECT MAX(score) FROM movies 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(9.3,)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">So 9.3 is the maximum rating score 
</div>

In [5]:
%%sql
SELECT MAX(score) FROM movies;
SELECT * FROM movies WHERE score = 9.3

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.
1 rows affected.

[('The Shawshank Redemption', 'R', 'Drama', 1994, 'October 14, 1994 (United States)', 9.3, 2400000, 'Frank Darabont', 'Stephen King', 'Tim Robbins', 'United States', 25000000, 28817291.0, 'Castle Rock Entertainment', 142)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">SO now 9.3 is not a dynamic so use another query insted of 9.3 
</div>

In [6]:
%%sql
SELECT * FROM movies WHERE score = (SELECT MAX(score) FROM movies)

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shawshank Redemption', 'R', 'Drama', 1994, 'October 14, 1994 (United States)', 9.3, 2400000, 'Frank Darabont', 'Stephen King', 'Tim Robbins', 'United States', 25000000, 28817291.0, 'Castle Rock Entertainment', 142)]

<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">This is the example of subquery
</div>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Scope of Sub Queries</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    <ul>subquery is a inner query</ul>
    <ul>And Normal query is a outer query</ul>
    <ul>First Execute inner query and the result stored it than Execute outer query</ul>
    <ul>The scope of inner query depend on outer query<ol>When the Exection complete of outer query than scope of inner query are Finished</ol></ul>


</div>

<img style="display: block;margin-left: auto;margin-right: auto;width: 80%; " src="./sql_images/sub.png">

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Types of Sub Queries</h1>

<div style="text-align:justify; color:blue; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
   <b> Based on :</b>
    <ul><i style='color:black;'>1 result Return :</i>
        <ol>1 Scaler :<ol>means return one value like 9.3 etc</ol></ol>
        <ol>2 Row :<ol>return one Row of Table</ol></ol>
        <ol>3 Table :<ol> return more the one Rows or Table</ol></ol>
    </ul><br>
    <img style="display: block;margin-left: auto;margin-right: auto;width: 60%; " src="./sql_images/types_sb.png">
    <ul><i style='color:black;'>2 Based on Working :</i>
        <ol>1 Independent : <ol>means Inner query are not Depend on outer query</ol></ol>
        <ol>2 Correlated :<ol>Inner query are Depends on outer query</ol></ol>
    </ul>


</div>

<div style="text-align:center; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note ! Independent subqueries can be scaler, row, table and correlated subqueries can also be scaler, row, table.
</div>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Uses of Sub Queries</h1>

<br>
<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Where can subqueries used ?
</div>

<img style="display: block;margin-left: auto;margin-right: auto;width: 55%; " src="./sql_images/used_of_sub.png">

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Independent Subquery - Scaler</h1>

<br>
<div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the movie with highest profit(vs order by)
</div>

In [7]:
%%sql
SELECT * FROM movies
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [41]:
%%sql
SELECT * FROM movies WHERE (gross - budget) = (SELECT MAX(gross-budget) FROM movies)
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('Titanic', 'PG-13', 'Drama', 1997, 'December 19, 1997 (United States)', 7.8, 1100000, 'James Cameron', 'James Cameron', 'Leonardo DiCaprio', 'United States', 200000000, 2201647264.0, 'Twentieth Century Fox', 194)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">try to understand how's they are working
</div>

In [17]:
%%sql
SELECT MAX(gross-budget) FROM movies
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(2001647264.0,)]

In [42]:
%%sql
SELECT *,gross,budget,gross-budget FROM movies WHERE (gross-budget) = 2001647264.0

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('Titanic', 'PG-13', 'Drama', 1997, 'December 19, 1997 (United States)', 7.8, 1100000, 'James Cameron', 'James Cameron', 'Leonardo DiCaprio', 'United States', 200000000, 2201647264.0, 'Twentieth Century Fox', 194, 2201647264.0, 200000000, 2001647264.0)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find how many movies have a rating > the avg <br>of all the movies ratings(find the count of above average movies)
</div>

In [49]:
%%sql
SELECT * FROM movies WHERE score > (SELECT AVG(score) FROM movies)
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146),
 ('Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action', 1980, 'June 20, 1980 (United States)', 8.7, 1200000, 'Irvin Kershner', 'Leigh Brackett', 'Mark Hamill', 'United States', 18000000, 538375067.0, 'Lucasfilm', 124),
 ('Airplane!', 'PG', 'Comedy', 1980, 'July 2, 1980 (United States)', 7.7, 221000, 'Jim Abrahams', 'Jim Abrahams', 'Robert Hays', 'United States', 3500000, 83453539.0, 'Paramount Pictures', 88),
 ('Caddyshack', 'R', 'Comedy', 1980, 'July 25, 1980 (United States)', 7.3, 108000, 'Harold Ramis', 'Brian Doyle-Murray', 'Chevy Chase', 'United States', 6000000, 39846344.0, 'Orion Pictures', 98),
 ('Friday the 13th', 'R', 'Horror', 1980, 'May 9, 1980 (United States)', 6.4, 123000, 'Sean S. Cunningham', 'Victor Miller', 'Betsy Palmer', 'United States', 550000, 39754601.0, 'Paramount Pictures', 95)]

In [50]:
%%sql
SELECT COUNT(*) FROM movies WHERE score > (SELECT AVG(score) FROM movies)

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(2077,)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the highest rated movie of 2000
</div>

In [58]:
%%sql
SELECT * FROM movies WHERE year = 2000
ORDER BY score DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('Gladiator', 'R', 'Action', 2000, 'May 5, 2000 (United States)', 8.5, 1400000, 'Ridley Scott', 'David Franzoni', 'Russell Crowe', 'United States', 103000000, 465380802.0, 'Dreamworks Pictures', 155)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Solved with Subqueries
</div>

In [62]:
%%sql
SELECT * FROM movies WHERE year = 2000 AND score = (SELECT MAX(score) FROM movies WHERE year = 2000)

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('Gladiator', 'R', 'Action', 2000, 'May 5, 2000 (United States)', 8.5, 1400000, 'Ridley Scott', 'David Franzoni', 'Russell Crowe', 'United States', 103000000, 465380802.0, 'Dreamworks Pictures', 155)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the highest rated movie among all movies whose number of votes are > the dataset avg votes
</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Nested Subqueries
</div>

In [67]:
%%sql
SELECT AVG(votes) FROM movies

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(Decimal('54494.5025'),)]

In [69]:
%%sql
SELECT * FROM movies WHERE votes > 54494.5025
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146),
 ('The Blue Lagoon', 'R', 'Adventure', 1980, 'July 2, 1980 (United States)', 5.8, 65000, 'Randal Kleiser', 'Henry De Vere Stacpoole', 'Brooke Shields', 'United States', 4500000, 58853106.0, 'Columbia Pictures', 104),
 ('Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action', 1980, 'June 20, 1980 (United States)', 8.7, 1200000, 'Irvin Kershner', 'Leigh Brackett', 'Mark Hamill', 'United States', 18000000, 538375067.0, 'Lucasfilm', 124),
 ('Airplane!', 'PG', 'Comedy', 1980, 'July 2, 1980 (United States)', 7.7, 221000, 'Jim Abrahams', 'Jim Abrahams', 'Robert Hays', 'United States', 3500000, 83453539.0, 'Paramount Pictures', 88),
 ('Caddyshack', 'R', 'Comedy', 1980, 'July 25, 1980 (United States)', 7.3, 108000, 'Harold Ramis', 'Brian Doyle-Murray', 'Chevy Chase', 'United States', 6000000, 39846344.0, 'Orion Pictures', 98)]

In [70]:
%%sql
SELECT * FROM movies WHERE votes > (SELECT AVG(votes) FROM movies) # add subquery
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146),
 ('The Blue Lagoon', 'R', 'Adventure', 1980, 'July 2, 1980 (United States)', 5.8, 65000, 'Randal Kleiser', 'Henry De Vere Stacpoole', 'Brooke Shields', 'United States', 4500000, 58853106.0, 'Columbia Pictures', 104),
 ('Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action', 1980, 'June 20, 1980 (United States)', 8.7, 1200000, 'Irvin Kershner', 'Leigh Brackett', 'Mark Hamill', 'United States', 18000000, 538375067.0, 'Lucasfilm', 124),
 ('Airplane!', 'PG', 'Comedy', 1980, 'July 2, 1980 (United States)', 7.7, 221000, 'Jim Abrahams', 'Jim Abrahams', 'Robert Hays', 'United States', 3500000, 83453539.0, 'Paramount Pictures', 88),
 ('Caddyshack', 'R', 'Comedy', 1980, 'July 25, 1980 (United States)', 7.3, 108000, 'Harold Ramis', 'Brian Doyle-Murray', 'Chevy Chase', 'United States', 6000000, 39846344.0, 'Orion Pictures', 98)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now check max score
</div>

In [71]:
%%sql
SELECT MAX(score) FROM movies WHERE votes > (SELECT AVG(votes) FROM movies) # add subquery

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(9.3,)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now apply condition score = 9.3
</div>

In [78]:
%%sql
SELECT * FROM movies WHERE 
votes > (SELECT AVG(votes) FROM movies) 
AND 
score = (9.3)

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shawshank Redemption', 'R', 'Drama', 1994, 'October 14, 1994 (United States)', 9.3, 2400000, 'Frank Darabont', 'Stephen King', 'Tim Robbins', 'United States', 25000000, 28817291.0, 'Castle Rock Entertainment', 142)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now add another subquery
</div>

In [82]:
%%sql
SELECT * FROM movies WHERE 

votes > (SELECT AVG(votes) FROM movies) 

AND 

score = (SELECT MAX(score) FROM movies)

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shawshank Redemption', 'R', 'Drama', 1994, 'October 14, 1994 (United States)', 9.3, 2400000, 'Frank Darabont', 'Stephen King', 'Tim Robbins', 'United States', 25000000, 28817291.0, 'Castle Rock Entertainment', 142)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Independent Subquery - Row</h1>

In [83]:
%sql USE case_study_1

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [84]:
%%sql
SHOW TABLES

 * mysql+pymysql://root:***@localhost:3307/mydb
7 rows affected.

[('delivery_partner',),
 ('food',),
 ('menu',),
 ('order_details',),
 ('orders',),
 ('restaurants',),
 ('users',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find all users who never ordered
</div>

In [86]:
%%sql
SELECT * FROM orders
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0)]

In [87]:
%%sql
SELECT * FROM users
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h')]

In [93]:
%%sql
SELECT DISTINCT(user_id) FROM users

 * mysql+pymysql://root:***@localhost:3307/mydb
7 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,)]

<br>
<div style="text-align:justify; color:black; font-size:18px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">SO find users id that are not in orders
</div>

In [92]:
%%sql
SELECT * FROM users WHERE user_id NOT IN (SELECT DISTINCT(user_id) FROM orders)

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[(6, 'Anupama', 'anupama@gmail.com', '46rdw2'),
 (7, 'Rishabh', 'rishabh@gmail.com', '4sw123')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find all movies of all those actors whose filmography's avg 8.5(take 25000 votes as cutoff) 
</div>

In [96]:
%sql USE mydb

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [125]:
%%sql
SELECT * FROM movies 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [131]:
%%sql 
SELECT star FROM movies WHERE votes > 25000 GROUP BY star HAVING AVG(score) > 8.5

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('Daveigh Chase',), ('Elijah Wood',), ('Roberto Benigni',)]

In [135]:
%%sql 
SELECT * FROM movies WHERE star IN ("Daveigh Chase","Elijah Wood","Roberto Benigni") AND votes > 25000

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('Life Is Beautiful', 'PG-13', 'Comedy', 1997, 'December 20, 1997 (Italy)', 8.6, 642000, 'Roberto Benigni', 'Vincenzo Cerami', 'Roberto Benigni', 'Italy', 20000000, 230098753.0, 'Melampo Cinematografica', 116),
 ('The Lord of the Rings: The Fellowship of the Ring', 'PG-13', 'Action', 2001, 'December 19, 2001 (United States)', 8.8, 1700000, 'Peter Jackson', 'J.R.R. Tolkien', 'Elijah Wood', 'New Zealand', 93000000, 897690072.0, 'New Line Cinema', 178),
 ('Spirited Away', 'PG', 'Animation', 2001, 'March 28, 2003 (United States)', 8.6, 679000, 'Hayao Miyazaki', 'Hayao Miyazaki', 'Daveigh Chase', 'Japan', 19000000, 355475245.0, 'Tokuma Shoten', 125)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now add a subquery 
</div>

In [138]:
%%sql 
SELECT * FROM movies WHERE star IN (SELECT star FROM movies WHERE votes > 25000 GROUP BY star HAVING AVG(score) > 8.5)

 * mysql+pymysql://root:***@localhost:3307/mydb
8 rows affected.

[('Johnny Stecchino', 'R', 'Comedy', 1991, 'October 24, 1991 (Italy)', 7.2, 10000, 'Roberto Benigni', 'Roberto Benigni', 'Roberto Benigni', 'Italy', 0, 626057.0, 'Cecchi Gori Group Tiger Cinematografica', 102),
 ('The Adventures of Huck Finn', 'PG', 'Adventure', 1993, 'April 2, 1993 (United States)', 6.2, 8000, 'Stephen Sommers', 'Mark Twain', 'Elijah Wood', 'United States', 6500000, 24103594.0, 'Steve White Productions', 108),
 ('Son of the Pink Panther', 'PG', 'Comedy', 1993, 'August 27, 1993 (United States)', 3.9, 5000, 'Blake Edwards', 'Maurice Richlin', 'Roberto Benigni', 'Italy', 25000000, 2438031.0, 'Filmauro', 93),
 ('North', 'PG', 'Adventure', 1994, 'July 22, 1994 (United States)', 4.5, 13000, 'Rob Reiner', 'Alan Zweibel', 'Elijah Wood', 'United States', 40000000, 7182747.0, 'Castle Rock Entertainment', 87),
 ('The War', 'PG-13', 'Drama', 1994, 'November 4, 1994 (United States)', 6.8, 12000, 'Jon Avnet', 'Kathy McWorter', 'Elijah Wood', 'United States', 0, 16928556.0, 'Island World', 126),
 ('Life Is Beautiful', 'PG-13', 'Comedy', 1997, 'December 20, 1997 (Italy)', 8.6, 642000, 'Roberto Benigni', 'Vincenzo Cerami', 'Roberto Benigni', 'Italy', 20000000, 230098753.0, 'Melampo Cinematografica', 116),
 ('The Lord of the Rings: The Fellowship of the Ring', 'PG-13', 'Action', 2001, 'December 19, 2001 (United States)', 8.8, 1700000, 'Peter Jackson', 'J.R.R. Tolkien', 'Elijah Wood', 'New Zealand', 93000000, 897690072.0, 'New Line Cinema', 178),
 ('Spirited Away', 'PG', 'Animation', 2001, 'March 28, 2003 (United States)', 8.6, 679000, 'Hayao Miyazaki', 'Hayao Miyazaki', 'Daveigh Chase', 'Japan', 19000000, 355475245.0, 'Tokuma Shoten', 125)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Independent Subquery - Table</h1>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the most profitable movie of each year 
</div>

In [142]:
%%sql
SELECT * FROM movies

LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [146]:
%%sql
SELECT year,MAX(gross-budget) FROM movies
GROUP BY year
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1980, 520375067.0),
 (1981, 371925971.0),
 (1982, 782410554.0),
 (1983, 442606177.0),
 (1984, 305107271.0)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">now add sub query
</div>

In [147]:
%%sql
SELECT * FROM movies WHERE (year,gross-budget) IN (SELECT year,MAX(gross-budget) FROM movies GROUP BY year)

 * mysql+pymysql://root:***@localhost:3307/mydb
22 rows affected.

[('Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action', 1980, 'June 20, 1980 (United States)', 8.7, 1200000, 'Irvin Kershner', 'Leigh Brackett', 'Mark Hamill', 'United States', 18000000, 538375067.0, 'Lucasfilm', 124),
 ('Indiana Jones and the Raiders of the Lost Ark', 'PG', 'Action', 1981, 'June 12, 1981 (United States)', 8.4, 905000, 'Steven Spielberg', 'Lawrence Kasdan', 'Harrison Ford', 'United States', 18000000, 389925971.0, 'Paramount Pictures', 115),
 ('E.T. the Extra-Terrestrial', 'PG', 'Family', 1982, 'June 11, 1982 (United States)', 7.8, 381000, 'Steven Spielberg', 'Melissa Mathison', 'Henry Thomas', 'United States', 10500000, 792910554.0, 'Universal Pictures', 115),
 ('Star Wars: Episode VI - Return of the Jedi', 'PG', 'Action', 1983, 'May 25, 1983 (United States)', 8.3, 973000, 'Richard Marquand', 'Lawrence Kasdan', 'Mark Hamill', 'United States', 32500000, 475106177.0, 'Lucasfilm', 131),
 ('Indiana Jones and the Temple of Doom', 'PG', 'Action', 1984, 'May 23, 1984 (United States)', 7.5, 459000, 'Steven Spielberg', 'Willard Huyck', 'Harrison Ford', 'United States', 28000000, 333107271.0, 'Paramount Pictures', 118),
 ('Back to the Future', 'PG', 'Adventure', 1985, 'July 3, 1985 (United States)', 8.5, 1100000, 'Robert Zemeckis', 'Robert Zemeckis', 'Michael J. Fox', 'United States', 19000000, 381906762.0, 'Universal Pictures', 116),
 ('Top Gun', 'PG', 'Action', 1986, 'May 16, 1986 (United States)', 6.9, 306000, 'Tony Scott', 'Jim Cash', 'Tom Cruise', 'United States', 15000000, 357288178.0, 'Paramount Pictures', 110),
 ('Fatal Attraction', 'R', 'Drama', 1987, 'September 18, 1987 (United States)', 6.9, 79000, 'Adrian Lyne', 'James Dearden', 'Michael Douglas', 'United States', 14000000, 320145693.0, 'Paramount Pictures', 119),
 ('Rain Man', 'R', 'Drama', 1988, 'December 16, 1988 (United States)', 8.0, 483000, 'Barry Levinson', 'Barry Morrow', 'Dustin Hoffman', 'United States', 25000000, 354825435.0, 'United Artists', 133),
 ('Indiana Jones and the Last Crusade', 'PG-13', 'Action', 1989, 'May 24, 1989 (United States)', 8.2, 707000, 'Steven Spielberg', 'Jeffrey Boam', 'Harrison Ford', 'United States', 48000000, 474171806.0, 'Paramount Pictures', 127),
 ('Ghost', 'PG-13', 'Drama', 1990, 'July 13, 1990 (United States)', 7.1, 203000, 'Jerry Zucker', 'Bruce Joel Rubin', 'Patrick Swayze', 'United States', 22000000, 505703557.0, 'Paramount Pictures', 127),
 ('Terminator 2: Judgment Day', 'R', 'Action', 1991, 'July 3, 1991 (United States)', 8.5, 1000000, 'James Cameron', 'James Cameron', 'Arnold Schwarzenegger', 'United States', 102000000, 520881154.0, 'Carolco Pictures', 137),
 ('Aladdin', 'G', 'Animation', 1992, 'November 25, 1992 (United States)', 8.0, 382000, 'Ron Clements', 'Ron Clements', 'Scott Weinger', 'United States', 28000000, 504050219.0, 'Walt Disney Pictures', 90),
 ('Jurassic Park', 'PG-13', 'Action', 1993, 'June 11, 1993 (United States)', 8.1, 894000, 'Steven Spielberg', 'Michael Crichton', 'Sam Neill', 'United States', 63000000, 1033928303.0, 'Universal Pictures', 127),
 ('The Lion King', 'G', 'Animation', 1994, 'June 24, 1994 (United States)', 8.5, 970000, 'Roger Allers', 'Irene Mecchi', 'Matthew Broderick', 'United States', 45000000, 1083720877.0, 'Walt Disney Pictures', 88),
 ('Toy Story', 'G', 'Animation', 1995, 'November 22, 1995 (United States)', 8.3, 913000, 'John Lasseter', 'John Lasseter', 'Tom Hanks', 'United States', 30000000, 394436586.0, 'Walt Disney Pictures', 81),
 ('Independence Day', 'PG-13', 'Action', 1996, 'July 3, 1996 (United States)', 7.0, 543000, 'Roland Emmerich', 'Dean Devlin', 'Will Smith', 'United States', 75000000, 817400891.0, 'Twentieth Century Fox', 145),
 ('Titanic', 'PG-13', 'Drama', 1997, 'December 19, 1997 (United States)', 7.8, 1100000, 'James Cameron', 'James Cameron', 'Leonardo DiCaprio', 'United States', 200000000, 2201647264.0, 'Twentieth Century Fox', 194),
 ('Armageddon', 'PG-13', 'Action', 1998, 'July 1, 1998 (United States)', 6.7, 403000, 'Michael Bay', 'Jonathan Hensleigh', 'Bruce Willis', 'United States', 140000000, 553709788.0, 'Touchstone Pictures', 151),
 ('Star Wars: Episode I - The Phantom Menace', 'PG', 'Action', 1999, 'May 19, 1999 (United States)', 6.5, 748000, 'George Lucas', 'George Lucas', 'Ewan McGregor', 'United States', 115000000, 1027082707.0, 'Lucasfilm', 136),
 ('Mission: Impossible II', 'PG-13', 'Action', 2000, 'May 24, 2000 (United States)', 6.1, 322000, 'John Woo', 'Bruce Geller', 'Tom Cruise', 'United States', 125000000, 546388108.0, 'Paramount Pictures', 123),
 ("Harry Potter and the Sorcerer's Stone", 'PG', 'Adventure', 2001, 'November 16, 2001 (United States)', 7.6, 685000, 'Chris Columbus', 'J.K. Rowling', 'Daniel Radcliffe', 'United Kingdom', 125000000, 1006968171.0, 'Warner Bros.', 152)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the highest rated movie of each genre votes cutoff 25000
</div>

In [148]:
%%sql
SELECT * FROM movies
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [157]:
%%sql
SELECT genre,MAX(score) FROM movies WHERE votes > 25000
GROUP BY genre

 * mysql+pymysql://root:***@localhost:3307/mydb
12 rows affected.

[('Action', 8.8),
 ('Adventure', 8.5),
 ('Animation', 8.6),
 ('Biography', 8.9),
 ('Comedy', 8.6),
 ('Crime', 8.9),
 ('Drama', 9.3),
 ('Family', 7.8),
 ('Fantasy', 7.6),
 ('Horror', 8.1),
 ('Mystery', 8.4),
 ('Romance', 7.0)]

In [159]:
%%sql
SELECT * FROM movies 
WHERE (genre,score) IN (SELECT genre,MAX(score) FROM movies WHERE votes > 25000 GROUP BY genre)
AND votes > 25000

 * mysql+pymysql://root:***@localhost:3307/mydb
12 rows affected.

[('The Thing', 'R', 'Horror', 1982, 'June 25, 1982 (United States)', 8.1, 382000, 'John Carpenter', 'Bill Lancaster', 'Kurt Russell', 'United States', 15000000, 19632053.0, 'Universal Pictures', 109),
 ('E.T. the Extra-Terrestrial', 'PG', 'Family', 1982, 'June 11, 1982 (United States)', 7.8, 381000, 'Steven Spielberg', 'Melissa Mathison', 'Henry Thomas', 'United States', 10500000, 792910554.0, 'Universal Pictures', 115),
 ('Starman', 'PG', 'Romance', 1984, 'December 14, 1984 (United States)', 7.0, 44000, 'John Carpenter', 'Bruce A. Evans', 'Jeff Bridges', 'United States', 22000000, 28744356.0, 'Columbia Pictures', 115),
 ('Back to the Future', 'PG', 'Adventure', 1985, 'July 3, 1985 (United States)', 8.5, 1100000, 'Robert Zemeckis', 'Robert Zemeckis', 'Michael J. Fox', 'United States', 19000000, 381906762.0, 'Universal Pictures', 116),
 ("Schindler's List", 'R', 'Biography', 1993, 'February 4, 1994 (United States)', 8.9, 1200000, 'Steven Spielberg', 'Thomas Keneally', 'Liam Neeson', 'United States', 22000000, 322161245.0, 'Universal Pictures', 195),
 ('The Shawshank Redemption', 'R', 'Drama', 1994, 'October 14, 1994 (United States)', 9.3, 2400000, 'Frank Darabont', 'Stephen King', 'Tim Robbins', 'United States', 25000000, 28817291.0, 'Castle Rock Entertainment', 142),
 ('Pulp Fiction', 'R', 'Crime', 1994, 'October 14, 1994 (United States)', 8.9, 1900000, 'Quentin Tarantino', 'Quentin Tarantino', 'John Travolta', 'United States', 8000000, 213928762.0, 'Miramax', 154),
 ('Life Is Beautiful', 'PG-13', 'Comedy', 1997, 'December 20, 1997 (Italy)', 8.6, 642000, 'Roberto Benigni', 'Vincenzo Cerami', 'Roberto Benigni', 'Italy', 20000000, 230098753.0, 'Melampo Cinematografica', 116),
 ('Dark City', 'R', 'Fantasy', 1998, 'February 27, 1998 (United States)', 7.6, 191000, 'Alex Proyas', 'Alex Proyas', 'Rufus Sewell', 'Australia', 27000000, 27200316.0, 'Mystery Clock Cinema', 100),
 ('Memento', 'R', 'Mystery', 2000, 'May 25, 2001 (United States)', 8.4, 1200000, 'Christopher Nolan', 'Christopher Nolan', 'Guy Pearce', 'United States', 9000000, 40047078.0, 'Newmarket Capital Group', 113),
 ('The Lord of the Rings: The Fellowship of the Ring', 'PG-13', 'Action', 2001, 'December 19, 2001 (United States)', 8.8, 1700000, 'Peter Jackson', 'J.R.R. Tolkien', 'Elijah Wood', 'New Zealand', 93000000, 897690072.0, 'New Line Cinema', 178),
 ('Spirited Away', 'PG', 'Animation', 2001, 'March 28, 2003 (United States)', 8.6, 679000, 'Hayao Miyazaki', 'Hayao Miyazaki', 'Daveigh Chase', 'Japan', 19000000, 355475245.0, 'Tokuma Shoten', 125)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the MAX highest grossing movies of actor/director combo in terms of total gross income </div>

In [160]:
%%sql
SELECT * FROM movies 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [189]:
%%sql
SELECT star,director,MAX(gross) AS `max_gross` FROM movies
GROUP BY star,director
HAVING `max_gross` IS NOT NULL
ORDER BY SUM(gross) DESC
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('Leonardo DiCaprio', 'James Cameron', 2201647264.0),
 ('Mel Gibson', 'Richard Donner', 321731527.0),
 ('Harrison Ford', 'Steven Spielberg', 474171806.0),
 ('Tom Hanks', 'Robert Zemeckis', 678226133.0),
 ('Matthew Broderick', 'Roger Allers', 1083720877.0)]

In [191]:
%%sql
SELECT * FROM movies WHERE (star,director,gross) 
IN (
    SELECT star,director,MAX(gross) AS `max_gross` FROM movies GROUP BY star,director
    HAVING `max_gross` IS NOT NULL
    ORDER BY SUM(gross) DESC
)
ORDER BY gross DESC 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('Titanic', 'PG-13', 'Drama', 1997, 'December 19, 1997 (United States)', 7.8, 1100000, 'James Cameron', 'James Cameron', 'Leonardo DiCaprio', 'United States', 200000000, 2201647264.0, 'Twentieth Century Fox', 194)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Correlated Subquery</h1>

<br>
<div style="text-align:Center; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Correlated subquery are Depend on outer Query </div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find all that movies that have a rating higher than the average rating of movies in the same genre </div>

In [192]:
%%sql
SELECT * FROM movies 
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [ ]:
%%sql
SELECT * FROM movies 
LIMIT 1

In [238]:
%%sql
SELECT name,genre,score,ROUND(AVG(score),1) FROM movies 
GROUP BY genre HAVING name = "The Shining"
# for verification i use The Shining movie score and avg of score

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'Drama', 8.4, 6.7)]

In [239]:
%%sql
SELECT * FROM movies m1
WHERE score > (SELECT ROUND(AVG(score),1) FROM movies m2 WHERE m2.genre = m1.genre)
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146),
 ('Star Wars: Episode V - The Empire Strikes Back', 'PG', 'Action', 1980, 'June 20, 1980 (United States)', 8.7, 1200000, 'Irvin Kershner', 'Leigh Brackett', 'Mark Hamill', 'United States', 18000000, 538375067.0, 'Lucasfilm', 124),
 ('Airplane!', 'PG', 'Comedy', 1980, 'July 2, 1980 (United States)', 7.7, 221000, 'Jim Abrahams', 'Jim Abrahams', 'Robert Hays', 'United States', 3500000, 83453539.0, 'Paramount Pictures', 88)]

<br>
<div style="text-align:justify; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">The Shining movie score are the greater than avg of genre (Drame)<br><br>Here inner sub query are depend on outer query <br>
outer query are iterate the score and check that outer query score are greater than of each genre score avearge(in the iner query)</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Lets Understand it<br><br> table inside inner query</div>

In [286]:
%%sql
SELECT genre,score,ROUND(AVG(score),1) FROM movies 
GROUP BY genre 
# here drama score avg is 6.0

 * mysql+pymysql://root:***@localhost:3307/mydb
17 rows affected.

[('Action', 8.7, 6.0),
 ('Adventure', 5.8, 6.2),
 ('Animation', 7.3, 6.9),
 ('Biography', 8.2, 7.1),
 ('Comedy', 7.7, 6.2),
 ('Crime', 7.1, 6.6),
 ('Drama', 8.4, 6.7),
 ('Family', 6.3, 6.6),
 ('Fantasy', 5.3, 6.0),
 ('History', 8.3, 8.3),
 ('Horror', 6.4, 5.7),
 ('Music', 7.2, 7.2),
 ('Mystery', 6.2, 6.5),
 ('Romance', 7.1, 6.4),
 ('Sci-Fi', 5.3, 6.0),
 ('Thriller', 4.9, 5.9),
 ('Western', 5.1, 5.7)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">now select movie Drama if score are greater > 6.7</div>

In [290]:
%%sql
SELECT * FROM movies WHERE score > 6.7
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

<br>
<div style="text-align:justify; color:black; font-size:18px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">SELECT * FROM movies m1<br>WHERE <br>score > (SELECT ROUND(AVG(score),1) FROM movies m2 WHERE m2.genre = m1.genre)<br> <ul>here m1.genre and m2.genre are compare both are Same like (Drama)</ul>
    <ul>for genre Drame replace (SELECT ROUND(AVG(score),1) FROM movies m2 WHERE m2.genre = m1.genre) with 6.7</ul>
<ul>So score > 6.7 (only for genre Drama)</ul><br>
<ul>SELECT * FROM movies m1 WHERE score > 6.7 (only for genre Drama)<br></ul>
</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find the favorite food of each customer</div>

In [294]:
%sql USE case_study_1

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [298]:
%sql SELECT * FROM order_details LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(1, 1001, 1), (2, 1001, 3), (3, 1002, 4)]

In [299]:
%sql SELECT * FROM orders LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0),
 (1002, 1, 2, 415, datetime.datetime(2022, 5, 26, 0, 0), 1, 19, 5, 2.0),
 (1003, 1, 3, 240, datetime.datetime(2022, 6, 15, 0, 0), 5, 29, 4, None)]

In [300]:
%sql SELECT * FROM users LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(1, 'Nitish', 'nitish@gmail.com', 'p252h'),
 (2, 'Khushboo', 'khushboo@gmail.com', 'hxn9b'),
 (3, 'Vartika', 'vartika@gmail.com', '9hu7j')]

In [307]:
%sql SELECT * FROM food LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(1, 'Non-veg Pizza', 'Non-veg'),
 (2, 'Veg Pizza', 'Veg'),
 (3, 'Choco Lava cake', 'Veg')]

In [348]:
%%sql
SELECT t2.user_id,t4.f_name,t1.name,COUNT(*) AS `count` FROM users t1
INNER JOIN orders t2 ON t1.user_id = t2.user_id
INNER JOIN order_details t3 ON t2.order_id = t3.order_id
INNER JOIN food t4 ON t3.f_id = t4.f_id
GROUP BY t4.f_name,t1.name

 * mysql+pymysql://root:***@localhost:3307/mydb
25 rows affected.

[(5, 'Chicken Popcorn', 'Neha', 3),
 (2, 'Chicken Wings', 'Khushboo', 1),
 (5, 'Chicken Wings', 'Neha', 3),
 (1, 'Chicken Wings', 'Nitish', 1),
 (3, 'Chicken Wings', 'Vartika', 3),
 (2, 'Choco Lava cake', 'Khushboo', 3),
 (5, 'Choco Lava cake', 'Neha', 5),
 (1, 'Choco Lava cake', 'Nitish', 5),
 (4, 'Masala Dosa', 'Ankit', 2),
 (2, 'Masala Dosa', 'Khushboo', 1),
 (3, 'Masala Dosa', 'Vartika', 1),
 (2, 'Non-veg Pizza', 'Khushboo', 1),
 (5, 'Non-veg Pizza', 'Neha', 2),
 (1, 'Non-veg Pizza', 'Nitish', 1),
 (3, 'Non-veg Pizza', 'Vartika', 1),
 (4, 'Rava Idli', 'Ankit', 2),
 (2, 'Rava Idli', 'Khushboo', 1),
 (2, 'Rice Meal', 'Khushboo', 2),
 (1, 'Rice Meal', 'Nitish', 2),
 (1, 'Roti meal', 'Nitish', 1),
 (4, 'Schezwan Noodles', 'Ankit', 3),
 (2, 'Schezwan Noodles', 'Khushboo', 1),
 (4, 'Veg Manchurian', 'Ankit', 3),
 (2, 'Veg Manchurian', 'Khushboo', 1),
 (2, 'Veg Pizza', 'Khushboo', 1)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now store this table as temporary with Common Table Expression (CTE)</div>

In [347]:
%%sql
WITH fav_food AS (
    SELECT t2.user_id,t4.f_name,t1.name,COUNT(*) AS `count` FROM users t1
    INNER JOIN orders t2 ON t1.user_id = t2.user_id
    INNER JOIN order_details t3 ON t2.order_id = t3.order_id
    INNER JOIN food t4 ON t3.f_id = t4.f_id
    GROUP BY t4.f_name,t1.name
)

SELECT * FROM fav_food f1 WHERE count = (SELECT MAX(count) FROM fav_food f2 WHERE f2.user_id = f1.user_id)

 * mysql+pymysql://root:***@localhost:3307/mydb
6 rows affected.

[(3, 'Chicken Wings', 'Vartika', 3),
 (2, 'Choco Lava cake', 'Khushboo', 3),
 (5, 'Choco Lava cake', 'Neha', 5),
 (1, 'Choco Lava cake', 'Nitish', 5),
 (4, 'Schezwan Noodles', 'Ankit', 3),
 (4, 'Veg Manchurian', 'Ankit', 3)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note Common Table Expression (CTE) we coverd on another topic<br>SO just assumed fav_food like a variable in which store a table</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here fav_food comapare the maximum count on inner subquery and inner subquery compare with same user id</div>

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In Above Examples i use Subqueries with WHERE</div>
<img style="display: block;margin-left: auto;margin-right: auto;width: 55%; " src="./sql_images/used_of_sub.png">

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in SELECT</h1>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">GET the percentage of votes for each movie compared to the total no of votes</div>

In [350]:
%sql USE mydb

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [352]:
%%sql
SELECT * FROM movies
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [367]:
%%sql
SELECT SUM(votes) FROM movies

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(Decimal('217978010'),)]

In [385]:
%%sql
SELECT name,(votes/217978010)*100 FROM movies
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('The Shining', Decimal('0.4253')),
 ('The Blue Lagoon', Decimal('0.0298')),
 ('Star Wars: Episode V - The Empire Strikes Back', Decimal('0.5505'))]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now use subquery instead of 217978010</div>

In [388]:
%%sql
SELECT name,(votes/( SELECT SUM(votes) FROM movies) )*100 FROM movies
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('The Shining', Decimal('0.4253')),
 ('The Blue Lagoon', Decimal('0.0298')),
 ('Star Wars: Episode V - The Empire Strikes Back', Decimal('0.5505'))]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Display all movie names, genre score and avg (score) of genre</div>

In [397]:
%%sql
SELECT name,score,genre, (SELECT AVG(score) FROM movies m2 WHERE m2.genre=m1.genre) AS "avg_of_genre" FROM movies m1
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('The Shining', 8.4, 'Drama', 6.673605947955388),
 ('The Blue Lagoon', 5.8, 'Adventure', 6.15194805194805),
 ('Star Wars: Episode V - The Empire Strikes Back', 8.7, 'Action', 6.014967741935484)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note ! AVoid to use SELECT subqueries WIth large dataset Use Different Approach First</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">This is the example of Correlated Subqueriy use with SELECT</div>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in FROM</h1>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Display average rating of all the restaurants</div>

In [400]:
%sql USE case_study_1

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [402]:
%%sql
SELECT * FROM restaurants

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1, 'dominos', 'Italian'),
 (2, 'kfc', 'American'),
 (3, 'box8', 'North Indian'),
 (4, 'Dosa Plaza', 'South Indian'),
 (5, 'China Town', 'Chinese')]

In [404]:
%%sql
SELECT * FROM orders
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1001, 1, 1, 550, datetime.datetime(2022, 5, 10, 0, 0), 1, 25, 5, 3.0),
 (1002, 1, 2, 415, datetime.datetime(2022, 5, 26, 0, 0), 1, 19, 5, 2.0),
 (1003, 1, 3, 240, datetime.datetime(2022, 6, 15, 0, 0), 5, 29, 4, None),
 (1004, 1, 3, 240, datetime.datetime(2022, 6, 29, 0, 0), 4, 42, 3, 5.0),
 (1005, 1, 3, 220, datetime.datetime(2022, 7, 10, 0, 0), 1, 58, 1, 4.0)]

In [419]:
%%sql
SELECT t2.r_name,t1.r_id,AVG(restaurant_rating) FROM orders t1
INNER JOIN restaurants t2 ON t2.r_id = t1.r_id
GROUP BY r_id

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('dominos', 1, 1.6666666666666667),
 ('kfc', 2, 2.2),
 ('box8', 3, 4.666666666666667),
 ('Dosa Plaza', 4, 3.6666666666666665),
 ('China Town', 5, 3.6666666666666665)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now use Subquery with FROM</div>

In [422]:
%%sql
SELECT r_id,AVG(restaurant_rating) AS `avg` FROM orders GROUP BY r_id

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1, 1.6666666666666667),
 (2, 2.2),
 (3, 4.666666666666667),
 (4, 3.6666666666666665),
 (5, 3.6666666666666665)]

In [426]:
%%sql

SELECT r_name,avg FROM ( SELECT r_id,AVG(restaurant_rating) AS `avg` FROM orders GROUP BY r_id ) t1 
INNER JOIN restaurants t2
ON t1.r_id = t2.r_id

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('dominos', 1.6666666666666667),
 ('kfc', 2.2),
 ('box8', 4.666666666666667),
 ('Dosa Plaza', 3.6666666666666665),
 ('China Town', 3.6666666666666665)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">this is the example of Correlated Subquerie that are used with FROM</div>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in JOIN</h1>

In [152]:
%sql USE mydb

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [153]:
%%sql
SELECT * FROM health_ins
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(0, 1, 39.0, 'male', 23.2, 91, 'Yes', 0, 'No', 'southeast', 1121.87),
 (1, 2, 24.0, 'male', 30.1, 87, 'No', 0, 'No', 'southeast', 1131.51),
 (2, 3, None, 'male', 33.3, 82, 'Yes', 0, 'No', 'southeast', 1135.94)]

In [224]:
%%sql
SELECT DISTINCT region FROM health_ins
LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[('southeast',), ('northwest',), (None,)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Compare a smokers data northeast vs southeast region for male and order by DESC on BOTH age</div>

In [246]:
%%sql
SELECT t1.gender,t1.age, t1.region, t2.gender,t2.age, t2.region FROM (SELECT * FROM health_ins WHERE smoker = 'Yes' AND region = 'northeast' AND gender = 'male') t1
JOIN (SELECT * FROM health_ins WHERE smoker = 'Yes' AND region = 'southeast' AND gender = 'male') t2 
ON t1.region != t2.region
ORDER BY t1.age DESC,t2.age DESC
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('male', 49.0, 'northeast', 'male', 50.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 50.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 49.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 49.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 48.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 47.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 46.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 46.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 46.0, 'southeast'),
 ('male', 49.0, 'northeast', 'male', 46.0, 'southeast')]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now Calcualte Both averages ages</div>

In [259]:
%%sql
SELECT FLOOR(AVG(t1.age)) AS 'northeast_age',FLOOR(AVG(t2.age)) AS 'southeast_age' FROM (SELECT * FROM health_ins WHERE smoker = 'Yes' AND region = 'northeast' AND gender = 'male') t1
JOIN (SELECT * FROM health_ins WHERE smoker = 'Yes' AND region = 'southeast' AND gender = 'male') t2 
ON t1.region != t2.region
GROUP BY t1.region,t2.region

ORDER BY t1.age DESC,t2.age DESC

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(32.0, 33.0)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in HAVING</h1>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Find genres having avg score > avg score of all the movies</div>

In [432]:
%sql USE mydb;

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [437]:
%%sql 
SELECT * FROM movies
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('The Shining', 'R', 'Drama', 1980, 'June 13, 1980 (United States)', 8.4, 927000, 'Stanley Kubrick', 'Stephen King', 'Jack Nicholson', 'United Kingdom', 19000000, 46998772.0, 'Warner Bros.', 146)]

In [442]:
%%sql 
SELECT genre,AVG(score) AS `avg` FROM movies
GROUP BY genre
HAVING avg > (SELECT AVG(score) FROM movies)

 * mysql+pymysql://root:***@localhost:3307/mydb
9 rows affected.

[('Animation', 6.883185840707964),
 ('Biography', 7.051999999999998),
 ('Crime', 6.645033112582782),
 ('Drama', 6.673605947955388),
 ('Family', 6.55),
 ('History', 8.3),
 ('Music', 7.2),
 ('Mystery', 6.500000000000001),
 ('Romance', 6.3999999999999995)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in INSERT</h1>

In [443]:
%sql USE case_study_1;

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [444]:
%sql SHOW TABLES

 * mysql+pymysql://root:***@localhost:3307/mydb
7 rows affected.

[('delivery_partner',),
 ('food',),
 ('menu',),
 ('order_details',),
 ('orders',),
 ('restaurants',),
 ('users',)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Create a new table</div>

In [459]:
%%sql
CREATE TABLE case_study_1.loyal_users(
    user_id INTEGER,
    name VARCHAR(255),
    money INTEGER
)

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

In [460]:
%sql SELECT * FROM loyal_users

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Populate a already created a loyal_customers table with records of only those customers who have ordered food more than 3 times</div>

In [473]:
%%sql

SELECT t2.name,t1.user_id FROM orders t1
INNER JOIN users t2 
ON t2.user_id = t1.user_id
GROUP BY t1.user_id
HAVING COUNT(*) > 3

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('Nitish', 1), ('Khushboo', 2), ('Vartika', 3), ('Ankit', 4), ('Neha', 5)]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now insert a values</div>

In [475]:
%%sql

INSERT INTO loyal_users(name,user_id)

SELECT t2.name,t1.user_id FROM orders t1
INNER JOIN users t2 
ON t2.user_id = t1.user_id
GROUP BY t1.user_id
HAVING COUNT(*) > 3

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">This is the example of use subqueries with Insert</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Check the values</div>

In [476]:
%%sql
SELECT * FROM loyal_users

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1, 'Nitish', None),
 (2, 'Khushboo', None),
 (3, 'Vartika', None),
 (4, 'Ankit', None),
 (5, 'Neha', None)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in UPDATE</h1>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Populate a money column of loyal_users table using the orders table<br>Provide a 10% money to all customers based on their orders values</div>

In [504]:
%%sql
SELECT user_id,SUM(amount)*0.1 AS `money` FROM orders
GROUP BY user_id

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1, Decimal('166.5')),
 (2, Decimal('267.0')),
 (3, Decimal('132.0')),
 (4, Decimal('180.0')),
 (5, Decimal('303.5'))]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now use Subquery for update money</div>

In [505]:
%%sql
UPDATE loyal_users
SET money = (
    
    SELECT SUM(amount)*0.1 AS `money` FROM orders  
    WHERE orders.user_id = loyal_users.user_id
)

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">This is the Example of use subquery with update</div>

In [506]:
%%sql
SELECT * FROM loyal_users

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[(1, 'Nitish', 167),
 (2, 'Khushboo', 267),
 (3, 'Vartika', 132),
 (4, 'Ankit', 180),
 (5, 'Neha', 304)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Subquery use in DROP (DELETE)</h1>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Delete  all the customers record who have never ordered</div>

In [500]:
%%sql
SELECT user_id FROM users WHERE user_id NOT IN (SELECT DISTINCT(user_id) FROM orders)

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[(6,), (7,)]

In [501]:
%%sql
DELETE FROM users WHERE user_id IN (
    SELECT user_id FROM users WHERE user_ID NOT IN (SELECT DISTINCT(user_id) FROM orders)
)

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now check the record</div>

In [502]:
%%sql
SELECT user_id FROM users WHERE user_id NOT IN (SELECT DISTINCT(user_id) FROM orders)

 * mysql+pymysql://root:***@localhost:3307/mydb
0 rows affected.

[]

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here user_id are not exists that means user_id data are deleted in the users</div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">This is the Example of use subquery with Drop (DELETE)</div>